# CreateStory

## Description
Creates a Story. Stories are used to group layers and are shown on the Story pane of the Organization dialog.

```pascal
FUNCTION CreateStory(
				name   : STRING;
				suffix : STRING) : BOOLEAN;
```

```python

def vs.CreateStory(name, suffix):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|name|STRING|The name of the Story to create.|
|suffix|STRING|The suffix to be used at the end of the name of a Layer assoiciated with the Story.|

## Returns
Whether the Story was successfully created.

## Examples
```pascal
VAR

success:BOOLEAN

BEGIN

success := CreateStory('4th Floor', '4');
```

## See Also
VS Functions:
GetNumStories| GetStoryOfLayer| AssociateLayerWithStory

## Version
Availability: from Vectorworks 2012
## Category
* Layers